[
    {
        "image": "90wonderland.jpg",
        "name": "Wonderland Amusement Park",
        "location": "Beijing, China",
        "date": "1998 (never open)",
        "background": "Wonderland was an ambitious but ultimately abandoned amusement park project located in Chenzhuang Village, Changping District, Beijing, China. Proposed by the Reignwood Group, it aimed to become Asia's largest amusement park, covering 120 acres. However, construction halted in 1998 due to financial issues with local officials. An attempt to resume construction in 2008 also failed. The site featured abandoned structures, including a castle-like building and medieval-themed outer buildings, reclaimed by local farmers for agriculture. Concerns over a property bubble arose with the project's abandonment. In May 2013, the incomplete structures were demolished. Plans for the site included a luxury product supermarket, later replaced by the construction of the Badaling Outlets shopping mall, which opened in 2015."
    },
    {
        "image": "90Gulliver.jpg",
        "name": "Gulliver’s kingdom",
        "location": "Japan",
        "date": "1997 - 2001",
        "background": "Gulliver's Kingdom theme park near Mount Fuji opened in 1997 but closed four years later due to a lack of visitors. The park failed to attract enough visitors, despite housing a 147 ft-tall statue of Gulliver himself being tied to the ground by the miniature Lilliputians, whom he encountered during his first adventure. It is located close to Japan's biggest suicide hotspot, perhaps suggesting why few people came."
    },
    {
        "image": "90china.jpg",
        "name": "Splendid China",
        "location": "Florida, US",
        "date": "1993 - 2003",
        "background": "Splendid China, located in Four Corners, Florida, was a theme park that opened in 1993 but closed on December 31, 2003. Costing $100 million to build, it was a sister park to Splendid China in Shenzhen, China. Spanning 75 acres, it featured over 60 replicas at one-tenth scale, meticulously handcrafted for authenticity. Initially, Chinese artists performed in the park but were later replaced by local performers after some sought political asylum in the US Criticism arose due to the Chinese government's ownership through the state-owned corporation China Travel Service, leading to objections from Citizens Against Communist Chinese Propaganda."
    },
    {
        "image": "90boom.jpg",
        "name": "Boomers! Dania Beach",
        "location": "Florida, US",
        "date": "1998 - 2015",
        "background": "Boomers! Parks is a well-known chain of family entertainment centers offering a variety of indoor and outdoor activities. Established in 2001 under Palace Entertainment, it was acquired by Apex Parks Group in 2014. Despite initial success, financial difficulties led to bankruptcy filing in 2020, resulting in the closures of several locations, including those in California and Dania Beach, Florida. Despite challenges, Boomers remains a popular destination for family fun, providing diverse attractions aimed at creating lasting memories for visitors. Boomers! Dania Beach closed on January 25, 2015. It is located next to the Dania Beach Hurricane roller coaster which closed in 2011. The roller coaster was owned and operated separately from the park. The site was demolished to become a new shopping plaza."
    },
    {
        "image": "90AA.jpg",
        "name": "American Adventures",
        "location": "Georgia, US",
        "date": "1990 - 2010",
        "background": "American Adventures was a small amusement park and family entertainment center located just north of Atlanta, adjacent to White Water Waterpark. Opening in 1990, it offered attractions like miniature golf, go-karts, an indoor arcade, and a collection of rides for children 12 and younger. The park's largest ride was the Ridgeline Racer rollercoaster. The admission was free, with rides and indoor entertainment priced individually or offered in a pay-one-price option. In 1999, Six Flags acquired American Adventures along with White Water, but the park retained its original name. In 2008, it was sold to Zuma Holdings LLC, operating independently of Six Flags. Sadly, in 2010, citing uncontrollable circumstances, American Adventures closed permanently. Six Flags reclaimed the property, repurposing it for storage, training, and employee facilities. In 2017, the remaining rides were dismantled and removed."
    }




]