[
    {
        "image": "00Enchanted.jpg",
        "name": "Enchanted Forest Playland",
        "location": "North Toledo, US",
        "date": "2000 – 2005",
        "background": "R.W. Bishop embarked on a lifelong journey in the amusement park industry that began in 1947 with a converted Woody Wagon for selling popcorn. Starting with a street vendor license, Bishop operated his popcorn business at various local events and even expanded to New York and Michigan. Eventually, he transitioned into building rides after years of concession sales, crafting his first fun house out of a walk-in van. In 2000, Bishop purchased land in North Toledo, where he constructed his home and established Enchanted Forest Playland, envisioning it as a venue for corporate picnics and school outings. However, changing family dynamics and the rise of electronic entertainment led to a decline in the park's popularity, ultimately resulting in its closure in 2005. Reflecting on his journey, Bishop expressed satisfaction in pursuing his passion for building and maintaining rides despite the challenges encountered along the way."
    },
    {
        "image": "00orleans.jpg",
        "name": "Six Flags New Orleans",
        "location": "New Orleans, US",
        "date": "2000 - 2009",
        "background": "Six Flags New Orleans, originally Jazzland, opened in 2000 and was leased by Six Flags in 2002. Hurricane Katrina caused severe damage in 2005, leading to permanent closure in 2009. Salvaged rides were relocated, and redevelopment plans failed, leaving the site abandoned. City officials tightened security to deter trespassers. In 2019, demolition discussions arose due to resident complaints. In 2023, Bayou Phoenix received approval for redevelopment plans. Meanwhile, the city earns revenue by leasing the site as a filming location."
    },
    {
        "image": "00amazing.jpg",
        "name": "Amazing World",
        "location": "Dongguan, China",
        "date": "2004 - 2023",
        "background": "Due to the expiration of the lease contract between the park and the property and the adjustment of the park's business plan, after careful study and decision, the indoor third-floor amusement area of Laughter World will officially close and cease operations from 18:00 on October 6, 2023. The amusement equipment inside Laughter World has ceased operations. Laughter World opened in 2005 and has been open for 18 years, carrying the childhood joy of countless people. Laughter World once had a glorious history. In 2009, it was selected as one of the \"Top Ten Attractions in Dongguan Favorite by Netizens\" by the judges. Over the years, many of Laughter World's former signature projects have gradually ceased operations. In addition, many pieces of equipment have gradually become obsolete, and the competitiveness has been greatly weakened compared to the beginning."
    },
    {
        "image": "00fort.jpg",
        "name": "Fort Rapids",
        "location": "Ohio, US",
        "date": "2006 - 2016",
        "background": "Fort Rapids, a hotel and water park in Columbus, Ohio, opened in 2006 alongside the Holiday Inn Columbus East. However, in February 2016, the Columbus Police Department ordered its closure due to numerous code violations. Subsequent issues included a burst water pipe in January 2018, leading to ice formation on exterior walls. In 2022, the city of Columbus imposed daily fines on Fort Rapids. In March 2023, the hotel owner was arrested. As of 2023, Fort Rapids remains closed, with the future of its indoor water park uncertain."
    },
    {
        "image": "00pier.jpg",
        "name": "Miracle Strip at Pier Park",
        "location": "Florida, US",
        "date": "2010 - 2015",
        "background": "Miracle Strip at Pier Park, an amusement park in Panama City Beach, Florida, originally closed in 2004 after 41 years of operation. However, a new park under the same name was established in March 2009, starting with the relocation of the carousel to Pier Park. Additional rides were purchased and moved, leading to a reopening in March 2010. The park expanded on a larger 14-acre site in April 2014 with new rides, games, and food vendors. Unfortunately, it closed in 2015, with many rides permanently relocated to Lake Winnepesaukah."
    }
]
